paymentintegrations/tests/xml/set_transaction_with_fraud_check.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://soap.api.controller.web.payjar.com/"
    xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <SOAP-ENV:Header>
        <wsse:Security SOAP-ENV:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-9" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>{username}</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{password}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:setTransaction>
            <Api>ONE_ZERO</Api>
            <Safekey>{safekey}</</Safekey>
            <TransactionType>PAYMENT</TransactionType>
            <AdditionalInformation>
                <merchantReference>{merchant_ref}</merchantReference>
                <cancelUrl>{cancel_url}</cancelUrl>
                <notificationUrl>{notification_url}</notificationUrl>
                <returnUrl>{return_url}</returnUrl>
                <supportedPaymentMethods>CREDITCARD</supportedPaymentMethods>
                <showBudget>false</showBudget>
            </AdditionalInformation>
            <Customer>
                <email>{customer_email}</email>
                <firstName>{customer_firstname}</firstName>
                <lastName>{customer_lastname}</lastName>
                <mobile>{customer_mobile}</mobile>
            </Customer>
            <Basket>
                <amountInCents>{basket_amount}</amountInCents>
                <currencyCode>{basket_currency_code}</currencyCode>
                <description>{basket_description}</description>
                <!--Zero or more repetitions:-->
                <productLineItem>
                    <amount>{product_lineitem_amount}</amount>
                    <costAmount>{product_lineitem_cost}</costAmount>
                    <description>{product_lineitem_description}</description>
                    <giftMessage>{product_lineitem_giftmessage}</giftMessage>
                    <productCode>{product_lineitem_productcode}</productCode>
                    <quantity>{product_lineitem_quantity}</quantity>
                    <recipientAddress1>{product_lineitem_address}</recipientAddress1>
                    <recipientCity>{product_lineitem_city}</recipientCity>
                    <recipientCountryCode>{product_lineitem_country_code}</recipientCountryCode>
                    <recipientPostalCode>{product_lineitem_postal_code}</recipientPostalCode>
                    <recipientFirstName>{product_lineitem_firstname}</recipientFirstName>
                    <recipientLastName>{product_lineitem_lastname}</recipientLastName>
                </productLineItem>
                <shippingDetails>
                    <shippingAddress1>{shipping_details_address}</shippingAddress1>
                    <shippingAddressCity>{shipping_details_city}</shippingAddressCity>
                    <shippingEmail>{shipping_details_email}</shippingEmail>
                    <shippingCountryCode>{shipping_details_country_code}</shippingCountryCode>
                    <shippingMethod>{shipping_details_method}</shippingMethod>
                    <shppingFirstName>{shipping_details_firstname}</shppingFirstName>
                    <shippingLastName>{shipping_details_lastname}</shippingLastName>
                    <shippingFax>{shipping_details_fax}</shippingFax>shippingFax>
                    <shippingPhone>{shipping_details_phone}</shippingPhone>shippingPhone>
                </shippingDetails>
            </Basket>
            <Fraud>
                <checkFraudOverride>{check_fraud_override}</checkFraudOverride>
                <merchantWebSite>{check_fraud_merchant_website}</merchantWebSite>
                <pcFingerPrint>{check_fraud_pc_fingerprint}</pcFingerPrint>
            </Fraud>
        </ns1:setTransaction>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
